Revit 2026 API

# ElectricalPhase Enumeration

---

An enumerated type to specify whether the electrical system is single phase or three phase.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ElectricalPhase
```
```vb
Public Enumeration ElectricalPhase
```
```cpp
public enum class ElectricalPhase
```
```fsharp
type ElectricalPhase
```

| Member name | Value | Description |
| --- | --- | --- |
| SinglePhase | 0 | Electrical phase is single phase. |
| ThreePhase | 1 | Electrical phase is three phase. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace